#!/usr/bin/env bash
# 出错立即退出
set -e

# 引入 logger.sh
source ./logger.sh

log_info "=============================================== 第一步：下载 jdk ==============================================="

./download_openjdk.sh

log_info "============================================== 第二步：下载 maven =============================================="

./download_maven.sh

log_info "============================================= 第三步：下载 phoenix ============================================="

./download_phoenix.sh

log_info "============================================= 第四步：构建 phoenix ============================================="

./build_phoenix.sh

log_info "✅ 自动化打包已完成..."